Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::FittingDefault Class Referencefinal
MEP Element Manager
The FittingDefault contains the necessary non-geometric data for creating a Fitting element. More...
#include <MEPFittingDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::FittingDefault:
 Public Member Functions
Result< UniqueID >  | Place (const API_Coord3D &coordinate, const Orientation &orientation, const std::optional< API_Guid > &requiredId=std::nullopt) const
Places a Fitting element based on this Default.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Result< ConnectorShape >  | GetShapeOfPort (uint32_t portIdx) const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Friends
 class  | Fitting
Result< FittingDefault >  | CreateFittingDefault (Domain)
Creates an FittingDefault.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Modifier (ElementDefault &)
Detailed Description
The FittingDefault contains the necessary non-geometric data for creating a Fitting element.
Since
Archicad 27
Example code snippet from Test / New MEP
Placement
 {
 auto ductFittingDefault = CreateFittingDefault (Domain::Ventilation);
 if (ductFittingDefault.IsErr ())
 return ductFittingDefault.UnwrapErr ().kind;
 Orientation orientation = { { 1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } };
 ACAPI::Result<UniqueID> fitting = ductFittingDefault->Place ({ 0.0, 20.0, 0.0 }, orientation, GSGuid2APIGuid (GS::Guid::GenerateGuid));
 if (fitting.IsErr ())
 return fitting.UnwrapErr ().kind;
 ACAPI_WriteReport ("Ventilation Fitting placed successfully", false);
 }
 {
 auto pipeFittingDefault = CreateFittingDefault (Domain::Piping);
 if (pipeFittingDefault.IsErr ())
 return pipeFittingDefault.UnwrapErr ().kind;
 Orientation orientation = { { 1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } };
 ACAPI::Result<UniqueID> fitting = pipeFittingDefault->Place ({ 10.0, 20.0, 0.0 }, orientation, GSGuid2APIGuid (GS::Guid::GenerateGuid));
 if (fitting.IsErr ())
 return fitting.UnwrapErr ().kind;
 ACAPI_WriteReport ("Piping Fitting placed successfully", false);
 }
 {
 auto cableCarrierFittingDefault = CreateFittingDefault (Domain::CableCarrier);
 if (cableCarrierFittingDefault.IsErr ())
 return cableCarrierFittingDefault.UnwrapErr ().kind;
 Orientation orientation = { { 1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } };
 ACAPI::Result<UniqueID> fitting = cableCarrierFittingDefault->Place ({ 20.0, 20.0, 0.0 }, orientation, GSGuid2APIGuid (GS::Guid::GenerateGuid));
 if (fitting.IsErr ())
 return fitting.UnwrapErr ().kind;
 ACAPI_WriteReport ("Cable Carrier Fitting placed successfully", false);
 }
Member Function Documentation
◆ Place()
 Result< UniqueID > ACAPI::MEP::v1::FittingDefault::Place  |  ( |  const API_Coord3D &  |  coordinate,
|  const Orientation &  |  orientation,
|  const std::optional< API_Guid > &  |  requiredId = std::nullopt
) |   |  const
Places a Fitting element based on this Default.
The implementation creates an Undoable Command Scope before executing the placement. This Command Scope is automatically closed after execution. When someone would like to group the placement of several routes and/or MEP elements together, it is recommended to create a single Command Scope. Doing this prevents the opening and closing of a Command Scope for every single created route and/or MEP element, therefore the performance should be improved.
Parameters
coordinate | The coordinate where the Fitting will be placed.
orientation | The orientation of the Fitting, which is based on a direction vector and a rotation vector.
requiredId | The guid to be set for the Fitting - optional parameter
Returns
If executed with success, returns the newly placed Fitting's uniqueId, otherwise Error.
Friends And Related Symbol Documentation
◆ CreateFittingDefault
 Result< FittingDefault > CreateFittingDefault  |  ( |  Domain  |  domain | )
friend
Creates an FittingDefault.
Parameters
domain | The Domain of the requested FittingDefault.
Returns
If able, returns a copy of Archicad's current Default of the Fitting tool for the domain defined by the parameter, otherwise Error.